<template>
  <div class="z-10">
    <div class="flex items-center justify-between px-4 py-2">
      <nuxt-link
        class="flex items-center flex-col text-center text-sm text-c-gray-5"
        :to="{ name: 'home' }"
        exact-active-class="active-router"
      >
        <div class="w-9 h-9 flex justify-center items-center">
          <svg
            width="20"
            height="22"
            viewBox="0 0 20 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M17.5725 19.6667H14.3333V12.0833C14.3333 11.4842 13.848 11 13.25 11H6.75C6.15092 11 5.66667 11.4842 5.66667 12.0833V19.6667H2.41667L2.42317 10.5482L9.99783 2.80133L17.5833 10.5927L17.5725 19.6667ZM7.83333 19.6667H12.1667V13.1667H7.83333V19.6667ZM19.126 9.03374L10.7746 0.492744C10.3662 0.0756608 9.63383 0.0756608 9.22542 0.492744L0.872917 9.03483C0.4775 9.44108 0.25 10.0087 0.25 10.5927V19.6667C0.25 20.8616 1.16758 21.8333 2.29533 21.8333H6.75H13.25H17.7036C18.8313 21.8333 19.75 20.8616 19.75 19.6667V10.5927C19.75 10.0087 19.5225 9.44108 19.126 9.03374Z"
              fill="#8A8A8A"
            />
          </svg>
        </div>

        Главная
      </nuxt-link>
      <nuxt-link
        class="flex items-center flex-col text-center text-sm text-c-gray-5"
        :to="{ name: 'categories' }"
        exact-active-class="active-router"
      >
        <div class="w-9 h-9 flex justify-center items-center">
          <svg
            width="22"
            height="22"
            viewBox="0 0 22 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M14.5 19.1667V14.5H19.1667L19.1678 19.1667H14.5ZM19.1667 12.1667H14.5C13.2132 12.1667 12.1667 13.2132 12.1667 14.5V19.1667C12.1667 20.4535 13.2132 21.5 14.5 21.5H19.1667C20.4535 21.5 21.5 20.4535 21.5 19.1667V14.5C21.5 13.2132 20.4535 12.1667 19.1667 12.1667ZM2.83333 19.1667V14.5H7.5L7.50117 19.1667H2.83333ZM7.5 12.1667H2.83333C1.5465 12.1667 0.5 13.2132 0.5 14.5V19.1667C0.5 20.4535 1.5465 21.5 2.83333 21.5H7.5C8.78683 21.5 9.83333 20.4535 9.83333 19.1667V14.5C9.83333 13.2132 8.78683 12.1667 7.5 12.1667ZM14.5 7.5V2.83333H19.1667L19.1678 7.5H14.5ZM19.1667 0.5H14.5C13.2132 0.5 12.1667 1.5465 12.1667 2.83333V7.5C12.1667 8.78683 13.2132 9.83333 14.5 9.83333H19.1667C20.4535 9.83333 21.5 8.78683 21.5 7.5V2.83333C21.5 1.5465 20.4535 0.5 19.1667 0.5ZM2.83333 7.5V2.83333H7.5L7.50117 7.5H2.83333ZM7.5 0.5H2.83333C1.5465 0.5 0.5 1.5465 0.5 2.83333V7.5C0.5 8.78683 1.5465 9.83333 2.83333 9.83333H7.5C8.78683 9.83333 9.83333 8.78683 9.83333 7.5V2.83333C9.83333 1.5465 8.78683 0.5 7.5 0.5Z"
              fill="#8A8A8A"
            />
          </svg>
        </div>
        Каталог
      </nuxt-link>
      <nuxt-link
        class="flex items-center flex-col text-center text-sm text-c-gray-5"
        :to="{ name: 'cart' }"
        exact-active-class="active-router"
      >
        <div class="w-9 h-9 flex relative justify-center items-center">
          <svg
            width="25"
            height="24"
            viewBox="0 0 25 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M18.4775 14.5H8.955L6.90875 7H22.2275L18.4775 14.5ZM24.3538 5.685C23.895 4.9425 23.1 4.5 22.2275 4.5H6.2275L5.45625 1.67125C5.3075 1.1275 4.81375 0.75 4.25 0.75H1.75C1.05875 0.75 0.5 1.31 0.5 2C0.5 2.69 1.05875 3.25 1.75 3.25H3.295L6.79375 16.0787C6.9425 16.6225 7.43625 17 8 17H19.25C19.7238 17 20.1563 16.7325 20.3688 16.3087L24.4638 8.1175C24.855 7.33625 24.8125 6.4275 24.3538 5.685ZM7.37525 19.5C6.34025 19.5 5.50025 20.3388 5.50025 21.375C5.50025 22.4112 6.34025 23.25 7.37525 23.25C8.41025 23.25 9.25025 22.4112 9.25025 21.375C9.25025 20.3388 8.41025 19.5 7.37525 19.5ZM18.0002 21.375C18.0002 20.3388 18.8402 19.5 19.8752 19.5C20.9102 19.5 21.7502 20.3388 21.7502 21.375C21.7502 22.4112 20.9102 23.25 19.8752 23.25C18.8402 23.25 18.0002 22.4112 18.0002 21.375Z"
              fill="#8A8A8A"
            />
          </svg>
          <div v-if="products.length" class="w-5 h-5 bg-c-red-1 rounded-full absolute text-c-gray-1 -top-1 -right-1 z-50">
            <span>{{ products.length }}</span>
          </div>
        </div>

        Корзина
      </nuxt-link>
      <!--      <nuxt-link
              class="flex items-center flex-col text-center text-sm text-c-gray-5"
              :to="{ name: 'cash' }"
              exact-active-class="active-router"
            >
              <div class="w-9 h-9 flex justify-center items-center">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M22.1406 7.06096C22.6153 7.06096 23 6.67627 23 6.20171V5.2995C23 2.92875 21.0709 1 18.6998 1C18.6998 1 5.22882 1.00202 5.1956 1.00593C4.06171 1.04554 2.97249 1.53205 2.18737 2.3546C1.38261 3.1977 0.963065 4.29427 1.00255 5.44802C1.00092 5.46989 1.00006 17.8413 1.00006 17.8413C1.00006 20.6858 3.31461 23 6.15956 23H18.6999C21.071 23 23 21.0712 23 18.7005V12.1767C23 9.806 21.071 7.87725 18.6999 7.87725H5.29688C3.91712 7.87725 2.78592 6.79898 2.7216 5.42246C2.6889 4.72252 2.94074 4.05437 3.43067 3.54105C3.92769 3.02035 4.62571 2.72176 5.34569 2.72176C5.37109 2.72176 18.6998 2.7185 18.6998 2.7185C20.1232 2.7185 21.2812 3.87633 21.2812 5.2995V6.20171C21.2813 6.67627 21.666 7.06096 22.1406 7.06096ZM5.29688 9.59574H18.6998C20.1232 9.59574 21.2812 10.7536 21.2812 12.1767V18.7005C21.2812 20.1237 20.1232 21.2815 18.6998 21.2815H6.15956C4.26233 21.2815 2.71881 19.7382 2.71881 17.8413V8.73997C3.43759 9.27829 4.33069 9.59574 5.29688 9.59574ZM19.5625 15.4386C19.5625 16.0318 19.0816 16.5127 18.4883 16.5127C17.0634 16.4561 17.0638 14.4209 18.4883 14.3646C19.0816 14.3646 19.5625 14.8454 19.5625 15.4386ZM19.5625 5.2995C19.5625 4.82494 19.1778 4.44026 18.7031 4.44026H5.29693C4.15671 4.48562 4.15757 6.11377 5.29693 6.15875H18.7031C19.1777 6.15875 19.5625 5.77407 19.5625 5.2995Z"
                    fill="#8A8A8A"
                    stroke-width="0.3"
                  />
                </svg>
              </div>
              Кошелёк
            </nuxt-link>-->
      <nuxt-link
        class="flex items-center flex-col text-center text-sm text-c-gray-5"
        :to="{ name: 'cabinet' }"
        exact-active-class="active-router"
      >
        <div class="w-9 h-9 flex justify-center items-center">
          <svg
            width="18"
            height="22"
            viewBox="0 0 18 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M11.5 5C11.5 3.62125 10.3787 2.5 9 2.5C7.62125 2.5 6.5 3.62125 6.5 5C6.5 6.37875 7.62125 7.5 9 7.5C10.3787 7.5 11.5 6.37875 11.5 5ZM14 5C14 7.7575 11.7575 10 9 10C6.2425 10 4 7.7575 4 5C4 2.2425 6.2425 0 9 0C11.7575 0 14 2.2425 14 5ZM0.25 20C0.25 15.175 4.17625 11.25 9 11.25C13.8237 11.25 17.75 15.175 17.75 20C17.75 20.69 17.1912 21.25 16.5 21.25C15.8088 21.25 15.25 20.69 15.25 20C15.25 16.5537 12.4462 13.75 9 13.75C5.55375 13.75 2.75 16.5537 2.75 20C2.75 20.69 2.19125 21.25 1.5 21.25C0.80875 21.25 0.25 20.69 0.25 20Z"
              fill="#8A8A8A"
            />
          </svg>
        </div>

        Профиль
      </nuxt-link>
    </div>
  </div>
</template>

<script>
import { mapState } from 'vuex'
export default {
  name: 'BottomNavbar',
  data () {
    return {
      activeitem: false
    }
  },
  computed: {
    activeItemClass () {
      return this.activeitem ? 'fill-current text-gray-5' : 'fill-current text-red-1'
    },
    ...mapState('cart', {
      products: state => state.products
    })
  }
}
</script>
