<template>
  <div class="container mx-auto py-4">
    <TitleContainer title-text="Политика обработки персональных данных" />
    <ol class="font-font-550 text-base grid grid-cols-1 gap-3">
      <li>I. <span class="underline">Общие положения</span></li>
      <li>II. <span class="underline">Область применения</span></li>
      <li>III. <span class="underline">Определения</span></li>
      <li>IV. <span class="underline">Правовые основания и цели обработки данных</span></li>
      <li>V. <span class="underline">Принципы и условия обработки данных</span></li>
      <li>
        VI. <span
          class="underline"
        >Права и обязанности субъектов данных, а также предприятии в части обработки данных</span>
      </li>
      <li>VII. <span class="underline">Требования к защите данных</span></li>
      <li>VIII. <span class="underline">Сроки обработки (хранения) данных</span></li>
      <li>IX. <span class="underline">Порядок получения разъяснений по вопросам обработки данных</span></li>
      <li>
        X. <span class="underline">Особенности обработки и защиты данных, собираемых предприятием с использованием сети интернет</span>
      </li>
      <li>XI. <span class="underline">Заключительные положения</span></li>
    </ol>
    <ol class="text-base grid grid-cols-1 gap-3">
      <li>
        <p class="my-7 font-font-550">
          I. <span class="underline">Общие положения</span>
        </p>
        <ol>
          <li>
            1.1. Настоящая Политика в отношении обработки персональных данных (далее – «Политика») подготовлена в
            соответствии Законами Республики Узбекистан <span class="font-font-550"><span class="uppercase">«О ПРИНЦИПАХ И ГАРАНТИЯХ СВОБОДЫ ИНФОРМАЦИИ»</span> и «Об
              информатизации»</span> и определяет позицию Семейного предприятия <span
              class="uppercase"
            >«OLCHA SAVDO»</span> (далее –
            «Предприятие») в
            области
            обработки и защиты персональных данных (далее – «Данные»), соблюдения прав и свобод каждого человека и, в
            особенности, права на неприкосновенность частной жизни, личную и семейную тайну.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          II. <span class="underline">Область применения</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            2.1. Настоящая Политика распространяется на Данные, полученные как до, так и после ввода в действие
            настоящей Политики.
          </li>
          <li>
            2.2. Понимая важность и ценность Данных, а также заботясь о соблюдении конституционных прав граждан
            Республики Узбекистан и граждан других государств, Предприятие обеспечивает надежную защиту Данных.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          III. <span class="underline">Определения</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            3.1. Под Данными понимается любая информация, относящаяся к прямо или косвенно определенному или
            определяемому физическому лицу (гражданину), т.е. к такой информации, в частности, относятся: ФИО, год,
            месяц, дата и место рождения, адрес, сведения о семейном, социальном, имущественном положении, сведения об
            образовании, профессии, доходах, номер телефона, адрес электронной почты для связи, информация о кандидатах
            на вакантные должности, оставленная такими кандидатами при заполнение анкеты, включая информацию,
            содержащуюся в резюме кандидата, а также другая информация.
          </li>
          <li>
            3.2. Под обработкой Данных понимается любое действие (операция) или совокупность действий (операций) с
            Данными, совершаемых с использованием средств автоматизации и/или без использования таких средств. К таким
            действиям (операциям) относятся: сбор, запись, систематизация, накопление, хранение, уточнение (обновление,
            изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание,
            блокирование, удаление, уничтожение Данных.
          </li>
          <li>
            3.3. Под безопасностью Данных понимается защищенность Данных от неправомерного и/или несанкционированного
            доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения Данных, а
            также от иных неправомерных действий в отношении Данных.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          IV. <span class="underline">Правовые основания и цели обработки данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            4.1. Обработка и обеспечение безопасности Данных в Предприятии осуществляется в соответствии с
            требованиями Конституции, Законами, Трудовым кодексом Республики Узбекистан, подзаконных актов, других
            определяющих случаи и особенности обработки данных законов Республики Узбекистан, руководящих и методических
            документов соответствующих органов Республики Узбекистан.
          </li>
          <li>
            4.2. Субъектами Данных, обрабатываемых Предприятием, являются:

            <br><br> кандидаты на вакантные должности, включая, кандидатов, заполняющих анкету кандидата на
            Интернет-ресурсе Предприятии:
            <a href="http://www.olcha.uz">http://www.olcha.uz</a>;

            <br><br> работники Предприятия, родственники работников Предприятия, в пределах, определяемых
            законодательством Республики Узбекистан, если сведения о них предоставляются работником;

            <br><br> лица, входящие в органы управления Предприятия и не являющимися работниками;

            <br><br> физические лица, с которыми Предприятием заключаются договоры гражданско-правового характера;

            <br><br> представители юридических лиц – контрагентов Предприятии;

            <br><br> участники бонусных программ лояльности;

            <br><br> клиенты – потребители, в т. ч. посетители сайта, принадлежащего Предприятию: <a
              href="http://www.olcha.uz"
            >http://www.olcha.uz</a>
            (далее – «Сайт»), в том числе с целью оформления заказа на Сайте с последующей доставкой клиенту, получатели
            услуг по доставке, наладке и установке бытовой техники;

            <br><br> физические лица, Данные которых обрабатываются в интересах третьих лиц – операторов Данных на
            основании договора (поручения операторов Данных).
          </li>
          <li>
            4.3. Предприятие осуществляет обработку Данных субъектов в целях, осуществления возложенных на Предприятию
            законодательством Республики Узбекистан функций, полномочий и обязанностей в соответствии с законами, в том
            числе, но не ограничиваясь, Гражданским кодексом, Налоговым кодексом, Трудовым кодексом, Семейным кодексом и
            другими законами Республики Узбекистан, а также операторами Данных, уставом и локальными актами Предприятия.
            <ol class="grid grid-cols-1 gap-3 mt-3">
              <li>
                4.3.1. Работников в целях:

                <br><br>соблюдения трудового, налогового и пенсионного законодательства Республики Узбекистан, а именно:

                <br><br>- содействия работникам в трудоустройстве, обучении и продвижении по службе;

                <br><br>- расчета и начисления заработной платы;

                <br><br>- организация деловых поездок (командировок) работников;

                <br><br>- оформления доверенностей (в том числе для представления интересов Предприятия перед третьими
                лицами);

                <br><br>- обеспечения личной безопасности работников;

                <br><br>- контроля количества и качества выполняемой работы;

                <br><br>- обеспечения сохранности имущества;

                <br><br>- соблюдения пропускного режима в помещениях Предприятия;

                <br><br>- учета рабочего времени;

                <br><br>- пользования различного вида льготами в соответствии с Трудовым, Налоговым кодексами и другими
                законами Республики Узбекистан, а также Уставом и нормативными актами Предприятия;

                <br><br>- добровольного страхования жизни, здоровья и/или от несчастных случаев.
              </li>
              <li>
                4.3.2. Кандидатов на вакантные должности в целях, принятия решения о возможности заключения трудового
                договора с лицами, претендующими на открытые вакансии.
              </li>
              <li>
                4.3.3. Лиц, входящих в органы управления Предприятием, не являющихся работниками, в целях, выполнения
                требований, предусмотренных законодательством, в т. ч. обязательное раскрытие информации, аудит,
                проверка возможности совершения сделок, в том числе сделок с заинтересованностью и/или крупных сделок.
              </li>
              <li>
                4.3.4. Контрагентов-физических лиц в целях:

                <br><br> заключения и исполнения договора, одной из сторон которого является физическое лицо;

                <br><br> рассмотрения возможностей дальнейшего сотрудничества.
              </li>
              <li>
                4.3.5. Представителей юридических лиц – контрагентов Предприятия в целях, ведения переговоров,
                заключение и исполнение договоров, по которым предоставляются Данные работников такого юридического лица
                для целей исполнения договора по различным направлениям хозяйственной деятельности Предприятия.
              </li>
              <li>
                4.3.6. Физических лиц, Данные которых обрабатываются в интересах третьих лиц – операторов Данных на
                основании договора (поручения операторов Данных) в целях, исполнения договоров – поручений операторов
                Данных.
              </li>
              <li>
                4.3.7. Родственников работников Предприятия в целях:

                <br><br>- исполнения требований законодательства Республики Узбекистан; предоставления дополнительных
                льгот;

                <br><br> участия в корпоративных мероприятиях.
              </li>
              <li>
                4.3.8. Участников бонусных программ лояльности в целях:

                <br><br> предоставления информации по товарам, проходящим акциям, состоянию лицевого счета;

                <br><br> идентификация участника в программе лояльности;

                <br><br>- обеспечение процедуры учета накопления и использования бонусов;

                <br><br> исполнения Предприятием обязательств по программе лояльности.
              </li>
              <li>
                4.3.9. Клиентов – потребителей в целях:

                <br><br> предоставления информации по товарам/услугам, проходящим акциям и специальным предложениям;

                <br><br> анализа качества предоставляемого Предприятием сервиса и улучшению качества обслуживания
                клиентов Предприятия;

                <br><br> информирования о статусе заказа;

                <br><br> исполнения договора, в т. ч. договора купли-продажи, в т. ч. заключенного дистанционным
                способом на Сайте, возмездного оказания услуг;

                <br><br> предоставления услуг по установке и подключению бытовой техники, а также учета оказанных
                потребителям услуг для осуществления взаиморасчетов;

                <br><br> доставки заказанного товара клиенту, совершившему заказ на Сайте, возврата товара.
              </li>
            </ol>
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          V. <span class="underline">Принципы и условия обработки данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            5.1. При обработке Данных Предприятие придерживается следующих принципов:

            <br><br> обработка Данных осуществляется на законной и справедливой основе;

            <br><br> Данные не раскрываются третьим лицам и не распространяются без согласия субъекта Данных, за
            исключением
            случаев, требующих раскрытия Данных по запросу уполномоченных государственных органов, судопроизводства;

            <br><br> определение конкретных законных целей до начала обработки (в т. ч. сбора) Данных;

            <br><br> ведется сбор только тех Данных, которые являются необходимыми и достаточными для заявленной цели
            обработки;

            <br><br> объединение баз данных, содержащих Данные, обработка которых осуществляется в целях, несовместимых
            между
            собой не допускается;

            <br><br> обработка Данных ограничивается достижением конкретных, заранее определенных и законных целей;

            <br><br> обрабатываемые Данные подлежат уничтожению или обезличиванию по достижению целей обработки или в
            случае
            утраты необходимости в достижении этих целей, если иное не предусмотрено законом.
          </li>
          <li>
            5.2. Предприятие может включать Данные субъектов в общедоступные источники Данных, при этом Предприятие
            берет письменное согласие субъекта на обработку его Данных.
          </li>
          <li>
            5.3. Предприятие не осуществляет обработку Данных, касающихся расовой, национальной принадлежности,
            политических взглядов, религиозных, философских и иных убеждений, интимной жизни, членства в общественных
            объединениях, в том числе в профессиональных союзах.
          </li>
          <li>
            5.4. Предприятие может осуществлять обработку данных о состоянии здоровья субъекта Данных в следующих
            случаях:

            <br><br>1) в соответствии с законодательством;

            <br><br>2) для защиты жизни, здоровья или иных жизненно важных интересов работника либо для защиты жизни,
            здоровья
            или иных жизненно важных интересов других лиц и получение согласия субъекта Данных невозможно;

            <br><br>3) для установления или осуществления прав работника или третьих лиц, а равно и в связи с
            осуществлением
            правосудия;

            <br><br>4) в соответствии с законодательством об обязательных видах страхования, со страховым
            законодательством.
          </li>
          <li>
            5.5. Биометрические Данные (сведения, которые характеризуют физиологические и биологические особенности
            человека, на основании которых можно установить его личность и которые используются оператором для
            установления личности субъекта Данные) в Предприятии не обрабатываются.
          </li>
          <li>5.6. Предприятие не осуществляет трансграничную передачу Данных.</li>
          <li>
            5.7. В случаях, установленных законодательством Республики Узбекистан, Предприятие вправе осуществлять
            передачу Данных третьим лицам (налоговой службе и иным государственным органам).
          </li>
          <li>
            5.8. Предприятие вправе поручить обработку Данных субъектов Данных третьим лицам с согласия субъекта
            Данных, на основании заключаемого с этими лицами договора.
          </li>
          <li>
            5.9. Лица, осуществляющие обработку Данных на основании заключаемого с Предприятием договора (поручения
            оператора), обязуются соблюдать принципы и правила обработки и защиты Данных, предусмотренные Законом. Для
            каждого третьего лица в договоре определяются перечень действий (операций) с Данными, которые будут
            совершаться третьим лицом, осуществляющим обработку Данных, цели обработки, устанавливается обязанность
            такого лица соблюдать конфиденциальность и обеспечивать безопасность Данных при их обработке, указываются
            требования к защите обрабатываемых Данных в соответствии с Законом.
          </li>
          <li>
            5.10. В целях исполнения требований действующего законодательства Республики Узбекистан и своих договорных
            обязательств обработка Данных в Предприятии осуществляется как с использованием, так и без использования
            средств автоматизации. Совокупность операций обработки включает сбор, запись, систематизацию, накопление,
            хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ),
            обезличивание, блокирование, удаление, уничтожение Данных.
          </li>
          <li>
            5.11. В Предприятии запрещается принятие на основании исключительно автоматизированной обработки Данных
            решений, порождающих юридические последствия в отношении субъекта Данных или иным образом затрагивающих его
            права и законные интересы, за исключением случаев, предусмотренных законодательством.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          VI. <span class="underline">
            Права и обязанности субъектов данных, а также предприятии в части обработки данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            6.1. Субъект, Данные которого обрабатываются Предприятием, имеет право получать от Предприятия:

            <br><br>- подтверждение факта обработки Данных и сведения о наличии Данных, относящихся к соответствующему
            субъекту
            Данных;

            <br><br>- сведения о правовых основаниях и целях обработки Данных;

            <br><br>- сведения о применяемых Предприятием способах обработки Данных;

            <br><br>- сведения о наименовании и местонахождении Предприятия;

            <br><br>- сведения о лицах (за исключением работников Предприятии), которые имеют доступ к Данным или
            которым могут
            быть раскрыты Данные на основании договора с Предприятием или на основании закона;

            <br><br>- перечень обрабатываемых Данных, относящихся к субъекту Данных, и информацию об источнике их
            получения,
            если иной порядок предоставления таких Данных не предусмотрен законом;

            <br><br>- сведения о сроках обработки Данных, в том числе о сроках их хранения;

            <br><br>- сведения о порядке осуществления субъектом Данных прав, предусмотренных Законом;

            <br><br>- наименование (Ф.И.О.) и адрес лица, осуществляющего обработку Данных по поручению Предприятия;

            <br><br>- иные сведения, предусмотренные Законом или другими нормативно-правовыми актами Республики
            Узбекистан;

            <br><br> требовать от Предприятия уточнения своих Данных, их блокирования или уничтожения в случае, если
            Данные
            являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для
            заявленной цели обработки;

            <br><br> отозвать свое согласие на обработку Данных в любой момент;

            <br><br> требовать устранения неправомерных действий Предприятии в отношении его Данных;

            <br><br> обжаловать действия или бездействие Предприятия в соответствующие органы власти или в судебном
            порядке в
            случае, если субъект Данных считает, что Предприятие осуществляет обработку его Данных с нарушением
            требований Закона или иным образом нарушает его права и свободы;

            <br><br> на защиту своих прав и законных интересов, в том числе на возмещения убытков и/или компенсацию
            морального
            вреда в судебном порядке.
          </li>
          <li>
            6.2. Предприятие в процессе обработки Данных обязана:

            <br><br> предоставлять субъекту Данных по его запросу информацию, касающуюся обработки его персональных
            данных,
            либо на законных основаниях предоставить отказ в течение тридцати дней с даты получения запроса субъекта
            Данных или его представителя;

            <br><br> разъяснить субъекту Данных юридические последствия отказа предоставить Данные, если предоставление
            Данных
            является обязательным в соответствии с законом;

            <br><br> до начала обработки Данных (если Данные получены не от субъекта Данных) предоставить субъекту
            Данных
            следующую информацию, за исключением случаев, предусмотренных законодательством Республики Узбекистан:

            <br><br>1) наименование либо фамилия, имя, отчество и адрес Предприятия или ее представителя;

            <br><br>2) цель обработки Данных и ее правовое основание;

            <br><br>3) предполагаемые пользователи Данных;

            <br><br>4) установленные Законом права субъектов Данных;

            <br><br>5) источник получения Данных.

            <br><br> принимать необходимые правовые, организационные и технические меры или обеспечивать их принятие для
            защиты
            Данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования,
            предоставления, распространения Данных, а также от иных неправомерных действий в отношении Данных;

            <br><br> опубликовать в сети Интернет и обеспечить неограниченный доступ с использованием сети Интернет к
            документу, определяющему его политику в отношении обработки Данных, к сведениям о реализуемых требованиях к
            защите Данных;

            предоставить субъектам Данных и/или их представителям безвозмездно возможность ознакомления с Данными при
            обращении с соответствующим запросом в течение 30 дней с даты получения подобного запроса;

            <br><br> осуществить блокирование неправомерно обрабатываемых Данных, относящихся к субъекту Данных, или
            обеспечить
            их блокирование (если обработка Данных осуществляется другим лицом, действующим по поручению Предприятия) с
            момента обращения или получения запроса на период проверки, в случае выявления неправомерной обработки
            Данных при обращении субъекта Данных или его представителя либо по запросу субъекту Данных или его
            представителя либо уполномоченного органа по защите прав субъектов персональных данных;

            <br><br> уточнить Данные либо обеспечить их уточнение (если обработка Данных осуществляется другим лицом,
            действующим по поручению Предприятия) в течение 7 рабочих дней со дня представления сведений и снять
            блокирование Данных, в случае подтверждения факта неточности Данных на основании сведений, представленных
            субъектом Данных или его представителем;

            <br><br> прекратить неправомерную обработку Данных или обеспечить прекращение неправомерной обработки Данных
            лицом,
            действующим по поручению Предприятия, в случае выявления неправомерной обработки Данных, осуществляемой
            Предприятием или лицом, действующим на основании договора с Предприятием, в срок, не превышающий 3 рабочих
            дней с даты этого выявления;

            <br><br> прекратить обработку Данных или обеспечить ее прекращение (если обработка Данных осуществляется
            другим
            лицом, действующим по договору с Предприятием) и уничтожить Данные или обеспечить их уничтожение (если
            обработка Данных осуществляется другим лицом, действующим по договору с предприятием) по достижения цели
            обработки Данных, если иное не предусмотрено договором, стороной которого, выгодоприобретателем или
            поручителем по которому является субъект Данных, в случае достижения цели обработки Данных;

            <br><br> прекратить обработку Данных или обеспечить ее прекращение и уничтожить Данные или обеспечить их
            уничтожение в случае отзыва субъектом Данных согласия на обработку Данных, если Предприятие не вправе
            осуществлять обработку Данных без согласия субъекта Данных;

            <br><br> вести журнал учета обращений субъектов персональных данных, в котором должны фиксироваться запросы
            субъектов Данных на получение Данных, а также факты предоставления Данных по этим запросам.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          VII. <span class="underline">Требования к защите данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            7.1. Предприятие при обработке Данных принимает необходимые правовые, организационные и технические меры для
            защиты Данных от неправомерного и/или несанкционированного доступа к ним, уничтожения, изменения,
            блокирования, копирования, предоставления, распространения Данных, а также от иных неправомерных действий в
            отношении Данных.
          </li>
          <li>
            7.2. К таким мерам в частности, относятся:

            <br><br> назначение лица, ответственного за организацию обработки Данных, и лица, ответственного за
            обеспечение
            безопасности Данных;

            <br><br> разработка и утверждение локальных актов по вопросам обработки и защиты Данных;

            <br><br> применение правовых, организационных и технических мер по обеспечению безопасности Данных:

            <br><br>1) определение угроз безопасности Данных при их обработке в информационных системах персональных
            данных;

            <br><br>2) применение организационных и технических мер по обеспечению безопасности Данных при их обработке
            в
            информационных системах персональных данных, необходимых для выполнения требований к защите Данных,
            исполнение которых обеспечивает установленные Законодательством и Правительством Республики Узбекистан
            уровни защищенности Данных;

            <br><br>3) применение прошедших в установленном порядке процедуру оценки соответствия средств защиты
            информации;

            <br><br>4) оценка эффективности принимаемых мер по обеспечению безопасности Данных до ввода в эксплуатацию
            информационной системы персональных данных;

            <br><br>5) учет машинных носителей Данных, если хранение Данных осуществляется на машинных носителях;

            <br><br>6) обнаружение фактов несанкционированного доступа к Данным и принятие мер по недопущению подобных
            инцидентов в дальнейшем;

            <br><br>7) восстановление Данных, модифицированных или уничтоженных вследствие несанкционированного доступа
            к ним;

            <br><br>8) установление правил доступа к Данным, обрабатываемым в информационной системе персональных
            данных, а
            также обеспечение регистрации и учета всех действий, совершаемых с Данными в информационной системе
            персональных данных.

            <br><br> контроль за принимаемыми мерами по обеспечению безопасности Данных и уровнем защищенности
            информационных
            систем персональных данных;

            <br><br> оценка вреда, который может быть причинен субъектам Данных в случае нарушения требований Закона,
            соотношение указанного вреда и принимаемых Предприятием мер, направленных на обеспечение выполнения
            обязанностей, предусмотренных Законодательством;

            <br><br> соблюдение условий, исключающих несанкционированный доступ к материальным носителям Данных и
            обеспечивающих сохранность Данных;

            <br><br> ознакомление работников Предприятия, непосредственно осуществляющих обработку Данных, с положениями
            законодательства Республики Узбекистан о Данных, в том числе с требованиями к защите Данных, локальными
            актами по вопросам обработки и защиты Данных, и обучение работников Предприятия.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          VIII. <span class="underline">Сроки обработки (хранения) данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            8.1. Сроки обработки (хранения) Данных определяются исходя из целей обработки Данных, в соответствии со
            сроком действия договора с субъектом Данных, требованиями законодательства, требованиями операторов Данных,
            по поручению которых Предприятие осуществляет обработку Данных, основными правилами работы архивов
            организаций, сроками исковой давности.
          </li>
          <li>
            8.2. Данные, срок обработки (хранения) которых истек, должны быть уничтожены, если иное не предусмотрено
            законодательством. Хранение Данных после прекращения их обработки допускается только после их обезличивания.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          IX. <span class="underline">Порядок получения разъяснений по вопросам обработки данных</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            9.1. Лица, чьи Данные обрабатываются Предприятием, могут получить разъяснения по вопросам обработки своих
            Данных, обратившись лично к Предприятию или направив соответствующий письменный запрос по адресу
            местонахождения
            Предприятии: 100000, г.Ташкент, Сергелийский район, массив «Сергели-8а», дом 23, кв-ра 29.
          </li>
          <li>
            9.2. В случае направления официального запроса к Предприятию в тексте запроса необходимо указать:

            <br><br>фамилию, имя, отчество субъекта Данных или его представителя;

            <br><br>номер основного документа, удостоверяющего личность субъекта Данных или его представителя, сведения
            о
            дате
            выдачи указанного документа и выдавшем его органе;

            <br><br>сведения, подтверждающие наличие у субъекта Данных отношений с Предприятием;

            <br><br>информацию для обратной связи с целью направления Предприятием ответа на запрос;

            <br><br>подпись субъекта Данных (или его представителя). Если запрос отправляется в электронном виде, то он
            должен
            быть оформлен в виде электронного документа и подписан электронной подписью в соответствии с
            законодательством
            Республики Узбекистан.
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          X. <span class="underline">Особенности обработки и защиты данных, собираемых предприятием с использованием сети интернет</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            10.1. Предприятие обрабатывает и защищает Данные, поступающие от пользователей Cайта, в том числе Данные
            Кандидатов на вакантные должности с ресурса: <a href="https://olcha.uz">https://olcha.uz</a>. (далее
            совместно – Cайт), а также поступающие
            на адреса корпоративной почты Предприятия, заканчивающиеся на <span
              class="underline"
            >support@olcha.uz</span>.
          </li>
          <li>
            10.2. Сбор Данных существуют два основных способа, с помощью которых Предприятие получает Данные с помощью
            сети Интернет:
            <ol class="grid grid-cols-1 gap-3 mt-3">
              <li>
                10.2.1. Предоставление Данных (включая фамилию, имя, должность, место работы, должность, контактный
                телефон, адрес электронной почты, адрес и др.) субъектами путем заполнения соответствующих форм на Сайте
                и
                посредством направления электронных писем на корпоративные адреса Предприятия.
              </li>
              <li>
                10.2.2. Автоматически собираемая информация Предприятии может собирать и обрабатывать сведения, не
                являющимися персональными данными:

                <br><br>информацию об интересах пользователей на Сайте на основе введенных поисковых запросов
                пользователей
                Сайта о реализуемых и предлагаемых к продаже товаров Предприятии с целью предоставления актуальной
                информации клиентам Предприятии при использовании Сайта, а также обобщения и анализа информации, о том
                какие разделы Сайта и товары пользуются наибольшим спросом у клиентов Предприятии;

                <br><br>обработка и хранение поисковых запросов пользователей Сайта с целью обобщения и создания
                клиентской
                статистики об использовании разделов Сайта. Предприятие автоматически получает некоторые виды
                информации,
                получаемой в процессе взаимодействия пользователей с Cайтом, переписки по электронной почте и т. п. Речь
                идет о технологиях и сервисах, таких как веб-протоколы, куки, веб-отметки, а также приложения и
                инструменты указанной третьей стороны.

                <br><br>Куки – это часть данных, автоматически располагающаяся на жестком диске компьютера при каждом
                посещении
                веб-сайта. Таким образом, куки – это уникальный идентификатор браузера для веб-сайта. Куки дают
                возможность хранить информацию на сервере и помогают легче ориентироваться в веб-пространстве, а также
                позволяют осуществлять анализ сайта и оценку результатов. Большинство веб-браузеров разрешают
                использование куки, однако можно изменить настройки для отказа от работы с куки или отслеживания пути их
                рассылки. При этом некоторые ресурсы могут работать некорректно, если работа куки в браузере будет
                запрещена.

                <br><br>Веб-отметки. На определенных веб-страницах или электронных письмах Предприятие может
                использовать
                распространенную в Интернете технологию «веб-отметки» (также известную как «тэги» или «точная
                GIF-технология»). Веб-отметки помогают анализировать эффективность веб-сайтов, например, с помощью
                измерения числа посетителей сайта или количества «кликов», сделанных на ключевых позициях страницы
                сайта.
                При этом веб-отметки, куки и другие мониторинговые технологии не дают возможность автоматически получать
                Данные. Если пользователь Сайта по своему усмотрению предоставляет свои Данные, например, при заполнении
                формы обратной связи или при отправке электронного письма, то только тогда запускаются процессы
                автоматического сбора подробной информации для удобства пользования вебсайтами и/или для
                совершенствования
                взаимодействия с пользователями.
              </li>
            </ol>
          </li>
          <li>
            10.3. Использование Данных Предприятие вправе пользоваться предоставленными Данными в соответствии с
            заявленными целями их сбора при наличии согласия субъекта Данных, если такое согласие требуется в
            соответствии
            с требованиями законодательства Республики Узбекистан в области Данных.

            <br><br>Полученные Данные в обобщенном и обезличенном виде могут использоваться для лучшего понимания
            потребностей
            покупателей товаров и услуг, реализуемых Предприятием и улучшения качества обслуживания.
          </li>
          <li>
            10.4. Передача Данных Предприятие может поручать обработку Данных третьим лицам исключительно с согласия
            субъекта Данных.

            <br><br>Также Данные могут передаваться третьим лицам в следующих случаях:

            <br><br>а) в качестве ответа на правомерные запросы уполномоченных государственных органов, в соответствии с
            законами,
            решениями суда и пр.

            <br><br>б) данные не могут передаваться третьим лицам для маркетинговых, коммерческих и иных аналогичных
            целей, за
            исключением случаев получения предварительного согласия субъекта Данных.
          </li>
          <li>
            10.5. Сайт содержит ссылки на иные веб-ресурсы, где может находиться полезная и интересная для пользователей
            Сайта информация, в том числе ссылки на такие ресурсы как: http://www.olcha.uz. При этом действие настоящей
            Политики не распространяется на такие иные сайты. Пользователям, переходящим по ссылкам на другие сайты,
            рекомендуется ознакомиться с политиками об обработке Данных, размещенными на таких сайтах.
          </li>
          <li>
            10.6. Пользователь Сайта может в любое время отозвать свое согласие на обработку Данных, направив
            электронное
            сообщение по адресу электронной почты: http://www.olcha.uz., либо направив письменное уведомление по адресу
            Предприятия: 100000, г.Ташкент, Сергелийский район, массив «Сергели-8а», дом 23, кв-ра 29. После получения
            такого сообщения обработка Данных пользователя будет прекращена, а его Данные будут удалены, за исключением
            случаев, когда обработка может быть продолжена в соответствии с законодательством
          </li>
        </ol>
      </li>
      <li>
        <p class="my-7 font-font-550">
          XI. <span class="underline">Заключительные положения</span>
        </p>
        <ol class="grid grid-cols-1 gap-3">
          <li>
            11.1. Настоящая Политика является локальным нормативным актом Предприятия.
          </li>
          <li>
            11.2. Настоящая Политика является общедоступной. Общедоступность настоящей Политики обеспечивается
            публикацией
            на Сайте Предприятия.
          </li>
          <li>
            11.3. Настоящая Политика может быть пересмотрена в любом из следующих случаев:

            <br><br>при изменении законодательства Республики Узбекистан в области обработки и защиты персональных
            данных;

            <br><br>в случаях получения предписаний от компетентных государственных органов на устранение
            несоответствий,
            затрагивающих область действия Политики;

            <br><br>по решению руководства Предприятия;

            <br><br>при изменении целей и сроков обработки Данных;

            <br><br>при изменении организационной структуры, структуры информационных и/или телекоммуникационных систем
            (или
            введении новых);

            <br><br>при применении новых технологий обработки и защиты Данных (в т. ч. передачи, хранения);

            <br><br>при появлении необходимости в изменении процесса обработки Данных, связанной с деятельностью
            Предприятия.
          </li>
          <li>
            11.4. В случае неисполнения положений настоящей Политики Предприятие и ее работники несут ответственность в
            соответствии с действующим законодательством Республики Узбекистан.
          </li>
          <li>
            11.5. Контроль исполнения требований настоящей Политики осуществляется лицами, ответственными за организацию
            обработки Данных Предприятия, а также за безопасность персональных данных.
          </li>
        </ol>
      </li>
    </ol>
  </div>
</template>

<script>
import TitleContainer from '~/mobile/reusable/TitleContainer'

export default {
  components: {
    TitleContainer
  }
}
</script>
