<template>
  <div class="container mx-auto py-4">
    <TitleContainer title-text="Публичная оферта" />
    <h3 class="text-c-gray-6 text-xl font-bold text-center my-8">
      Публичная оферта интернет-магазина <span class="underline">«Olcha.uz»</span>
    </h3>
    <div class="text-c-gray-6 text-base">
      <p>
        Настоящая публичная Оферта (далее по тексту — Договор) является официальным предложением ООО (далее по
        тексту — ООО) «OLCHA STORE» в адрес любого физического или юридического лица, обладающего дееспособностью и
        необходимым полномочием заключить с ООО «OLCHA STORE» договор купли-продажи Товара на условиях, определенных в
        настоящей оферте и содержит все существенные условия договора.
      </p>
      <ol>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            I. ПРАВОВАЯ ОСНОВА
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>1.1.</strong> Оферта разработана в соответствии с Гражданским кодексом Республики Узбекистан, с
              законами
              Республики Узбекистан "Об электронной коммерции", "Об электронном документообороте" и другими
              нормативно-правовыми актами регламентируют осуществление реализации товаров (работ, услуг) в форме
              электронной коммерции, представленный в официальном Интернет-магазине ООО «OLCHA UZ» по интернет адресу:
              <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
            </li>
            <li>
              <strong>1.2.</strong> Оптовая и розничная торговля, осуществляемая в форме электронной коммерции,
              регламентируется
              Положением о порядке осуществления оптовой и розничной торговой деятельности, утвержденным постановлением
              Кабинета Министров Республики Узбекистан от 26 ноября 2002 г. за № 407, Правилами розничной торговли в
              Республике Узбекистан, утвержденным постановлением Кабинета Министров Республики Узбекистан от 13 февраля
              2003 г. за № 75 и Правилами осуществления электронной коммерции, утвержденным постановлением Кабинета
              Министров Республики Узбекистан от 02 июня 2016 г. за № 185.
            </li>
            <li>
              <strong>1.3.</strong> Отношения в области защиты прав потребителей регулируются Гражданским кодексом
              Республики
              Узбекистан, Законом Республики Узбекистан «О защите прав потребителей» от 26 апреля 1996 года. за №221-I и
              другими нормативно-правовыми актами Республики Узбекистан.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            II. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>2.1.</strong> В настоящей оферте, если контекст не требует иного, нижеприведенные термины имеют
              следующие значения и являются ее составной неотъемлемой частью:
              <br><br><span class="font-font-550">Акцепт</span> — согласие с предложением (офертой) на заключение
              договора
              на условиях, указанных в предложении
              влекущее за собой правовые последствия.
              <br><br><span class="font-font-550">Заказ Товара на сайте интернет-магазина</span> — позиции, указанные
              Покупателем из ассортимента Товара,
              предложенного к продаже, при оформлении заявки на приобретение Товара на сайте Интернет-магазина ООО
              «OLCHA UZ» по интернет адресу: <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>. или
              через Оператора по телефону
              <a href="tel:712022021" class="underline">(71) 202-202-1</a>.
              <br><br><span class="font-font-550">Интернет-магазин</span> — официальный Интернет-магазин Продавца ООО
              «OLCHA
              STORE», расположенный по интернет
              адресу: <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
              <br><br><span class="font-font-550">Оферта</span> — предложение, адресованное одному лицу, нескольким
              конкретным лицам или неопределенному кругу
              лиц,
              содержащее все существенные условия договора, из которого усматривается воля лица, делающего предложение
              (оферента), заключить договор на указанных в предложении условиях с любым, кто отзовется.
              <br><br><span class="font-font-550">Продавец</span> — Интернет-магазин розничной торговли ООО «OLCHA
              STORE».
              <br><br><span class="font-font-550">Покупатель</span> — любое физическое лицо (резиденты и нерезиденты
              Республики Узбекистан), приобретающие
              товары
              (работы, услуги) с использованием информационных систем для конечного потребления, акцептировавшее
              публичную оферту на условиях настоящей оферты.
              <br><br><span class="font-font-550">Товар</span> — объект соглашения сторон, перечень наименований
              ассортимента, представленный в официальном
              Интернет-магазине ООО «OLCHA STORE» по интернет адресу: <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
              <br><br><span class="font-font-550">Участник электронной коммерции</span> — физическое лицо, являющееся
              Продавцом или Покупателем товаров (работ,
              услуг) в электронной коммерции.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            III. ОБЩИЕ ПОЛОЖЕНИЯ
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>3.1. </strong>Заказ Покупателем Товара, размещенного на сайте интернет-магазина означает, что
              Покупатель согласен со всеми условиями настоящей Оферты, что является прямым акцептом условий договора
              Оферента.
            </li>
            <li>
              <strong>3.2. </strong>Администрация сайта Интернет-магазина имеет право вносить изменения в Оферту без
              уведомления Покупателя. В случае внесения изменений в действующую Оферту, изменения вступают в законную
              силу по истечению 10 календарных дней с даты официальной публикации на сайте.
            </li>
            <li>
              <strong>3.3. </strong>Срок действия Оферты не ограничен, если иное не указано на сайте Интернет-магазина.
            </li>
            <li>
              <strong>3.4. </strong>Продавец предоставляет Покупателю полную и достоверную информацию о Товаре, со всеми
              существенными условиями договора, включая информацию об основных потребительских свойствах Товара, месте
              изготовления, а также информацию о гарантийном сроке и сроке годности Товара на сайте Интернет-магазина
              ООО «OLCHA STORE» по интернет адресу:
              <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            IV.ЦЕНА ТОВАРА
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>4.1. </strong>Цена на каждую позицию Товара указана на сайте Интернет-магазина по интернет адресу:
              <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
            </li>
            <li>
              <strong>4.2. </strong>Цены на Товар определяются в одностороннем бесспорном порядке и указываются на
              страницах интернет-магазина.
            </li>
            <li>
              <strong>4.3. </strong>Цена Товара указывается в национальной валюте Республики Узбекистан — сум.
            </li>
            <li>
              <strong>4.4. </strong>Предложение о заключении договора на конкретный Товар действует в течении срока
              наличия Товара у Продавца. Нахождения Товара на интернет-сайте Продавца не является гарантией его наличия.
              В случае если на определенные Товары будут приняты заявки от Покупателей на приобретение с 100 %
              предоплатой, и при этом данный Товар от не зависящих от Продавца причин не окажется в наличии, Покупателю
              будут предложены на выбор один из следующих вариантов (условий):

              <br><br>- Возврат всей суммы предоплаты;

              <br><br>- Новая оферта с новыми сроками поставки;

              <br><br>- Выбор другого ассортимента Товара имеющегося в наличии с доплатой или возвратом части денег
              исходя из
              суммы ранее внесенной Покупателем в размере 100 % предоплаты.
            </li>
            <li>
              <strong>4.5. </strong>Продавец имеет право в одностороннем порядке изменить цену на любую позицию Товара.
              При этом, новые (измененные) цены вступают в силу с даты официальной публикации на сайте.
            </li>
            <li>
              <strong>4.6. </strong>Изменение Продавцом цены на оплаченный Покупателем Товар не допускается.
            </li>
            <li>
              <strong>4.7. </strong>В случае изменения цены на заказанный Товар Продавец обязуется в течение 24 часов
              проинформировать Покупателя об изменении цены Товара. Покупатель вправе подтвердить либо аннулировать
              Заказ на приобретение Товара, если цена изменена Продавцом после оформления Заказа.
            </li>
            <li>
              <strong>4.8. </strong>Обязательства Покупателя по оплате Товара считаются исполненными с момента
              поступления Продавцу денежных средств в размере 100 % предоплаты.
            </li>
            <li>
              <strong>4.9. </strong>Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо
              сообщает Покупателю при оформлении заказа Оператором.
            </li>
            <li>
              <strong>4.10. </strong>Расчеты между Продавцом и Покупателем за Товар производятся способами, указанными
              на сайте Интернет-магазина.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            V. МОМЕНТ ЗАКЛЮЧЕНИЯ ДОГОВОРА
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>5.1. </strong>Текст данного Договора является публичной офертой (в соответствии с частью 2 ст. 369
              и ст. 426 Гражданского кодекса Республики Узбекистан).
            </li>
            <li>
              <strong>5.2. </strong>Договор, заключаемый на основании акцептирования Покупателем, настоящей оферты
              является договором присоединения, к которому Покупатель присоединяется без каких-либо исключений и/или
              оговорок.
            </li>
            <li>
              <strong>5.3. </strong>Товары и услуги, представленные на сайте через графические изображения-образцы,
              являются собственностью интернет-магазина.
            </li>
            <li>
              <strong>5.4. </strong>В связи с разными техническими характеристиками мониторов, цвет Товара может
              отличаться от представленного на сайте.
            </li>
            <li>
              <strong>5.5. </strong>Внешний вид и характеристики Товара может отличаться от описанного на сайте.
            </li>
            <li>
              <strong>5.6. </strong>По просьбе Покупателя менеджер интернет-магазина обязан предоставить (по телефону
              или посредством электронной почты) информацию, необходимую и достаточную, с точки зрения Покупателя, для
              принятия им решения о покупке товара.
            </li>
            <li>
              <strong>5.7. </strong>Факт оформления заказа Покупателем является безоговорочным фактом принятия
              Покупателем условий данного Договора.
            </li>
            <li>
              <strong>5.8. </strong>Покупатель, приобретший товар в Интернет-магазине Продавца (оформивший заказ
              товара), рассматривается как лицо, вступившее с Продавцом в отношения на условиях настоящего Договора.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            VI. ПРАВА И ОБЯЗАННОСТИ СТОРОН
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <p class="font-font-550 mb-3">
                6.1. Продавец обязуется:
              </p>
              <ul class="grid grid-cols-1 gap-3">
                <li>
                  <strong>6.1.1.</strong> С момента заключения настоящего Договора обеспечить в полной мере все
                  обязательства перед
                  Покупателем в соответствии с условиями настоящего договора и действующего законодательства.
                </li>
                <li>
                  <strong>6.1.2.</strong> Обрабатывать персональные данные Покупателя и обеспечивать их
                  конфиденциальность
                  в порядке, установленном действующим законодательством.
                </li>
                <li>
                  <strong>6.1.3.</strong> Предоставить Покупателю возможность получения бесплатных телефонных
                  консультаций
                  по телефонам, указанным на сайте Интернет-магазина (<a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>).
                  Объем консультаций ограничивается
                  конкретными вопросами, связанными с выполнениями Заказа и характеристиками Товара.
                </li>
                <li>
                  <strong>6.1.4.</strong> Предотвращать попытки несанкционированного доступа к информации и/или передачу
                  ее лицам, не имеющим непосредственного отношения к исполнению Заказов, своевременно обнаруживать и
                  пресекать такие факты.
                </li>
              </ul>
            </li>
            <li>
              <p class="font-font-550 mb-3">
                6.2. Продавец имеет право:
              </p>
              <ol class="grid grid-cols-1 gap-3">
                <li>
                  <strong>6.2.1. </strong>Изменять настоящий Договор, Цены на Товар и Тарифы на сопутствующие услуги,
                  способы и сроки оплаты и доставки товара в одностороннем порядке, помещая их на страницах
                  интернет-магазина, расположенного по интернет-адресу:
                  <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
                </li>
                <li>
                  <strong>6.2.2. </strong>Все изменения вступают в силу после публикации в сроках в соответствии с
                  условиями Оферты и считаются доведенными до сведения Покупателя с момента такой публикации.
                </li>
                <li>
                  <strong>6.2.3. </strong>Осуществлять записи телефонных переговоров с Покупателем.
                </li>
                <li>
                  <strong>6.2.4. </strong>Без согласования с Покупателем, передавать свои права и обязанности по
                  исполнению Договора третьим лицам.
                </li>
                <li>
                  <strong>6.2.5. </strong>Передавать на хранение информационным посредникам электронные документы и
                  электронные сообщения.
                </li>
                <li>
                  <strong>6.2.6. </strong>Невыполнения обязательств по Договору в случае возникновения обстоятельств
                  непреодолимой силы, указанных в главе ХI настоящего Договора, а также изменения условий выполнения
                  обязательств в соответствии с п.4.4 настоящего договора.
                </li>
                <li>
                  <strong>6.2.7. </strong>В случае если без каких либо уважительных причин Покупатель не оплатит и не
                  примет заказанный Товар или не примет заказанный и ранее оплаченный им Товар поставленный в указанных
                  сроках на ранее оговоренный адрес (территорию) Покупателем или третьим лицом (юридическим лицом
                  оказывающий услуги по доставке Товара с которым Покупатель заключил договор на оказание
                  транспортно-экспедиторских услуг) Покупатель вправе в одностороннем порядке расторгнуть договор и
                  потребовать от Покупателя возмещения понесенных убытков или удержать Товар до того момента как
                  Покупатель будет готов оплатить и принять или принять ранее оплаченный Товар в новые сроки,
                  согласованные продавцом, после повторной оплаты покупателем стоимости услуг по доставке товара.
                </li>
                <li>
                  <strong>6.2.8. </strong>Продавец вправе отказать Покупателю в приеме и исполнении заказа, если
                  Покупатель делал ранее заказ и не оплачивал его, отказывался от заказа в момент доставки Товара, не
                  принимал доставленный Товар, либо если у Продавца есть сомнения в достоверности указанных данных
                  Покупателя, без объяснения причин.
                </li>
                <li>
                  <strong>6.2.9. </strong>В случае, если у Продавца возникают основания предполагать, что
                  предоставленная Пользователем при оформлении Заказа информация не соответствует действительности или
                  предоставлена в неполном объеме, а также в случае оскорбительного и/или неадекватного поведения,
                  Продавец имеет право отказать в приеме Заказа Покупателю на временной или постоянной основе.
                </li>
              </ol>
            </li>
            <li>
              <p class="font-font-550 mb-3">
                6.3. Покупатель обязуется:
              </p>
              <ol class="grid grid-cols-1 gap-3">
                <li>
                  <strong>6.3.1. </strong>До момента заключения Договора ознакомиться с содержанием и условиями
                  Договора, ценами на Товар, предлагаемыми Продавцом в интернет-магазине, а также другими условиями на
                  страницах интернет-магазина, расположенного по интернет-адресу:
                  <a href="https://olcha.uz" class="font-font-550">https://olcha.uz</a>
                </li>
                <li>
                  <strong>6.3.2. </strong>Во исполнение Продавцом своих обязательств перед Покупателем последний должен
                  сообщить все необходимые данные, указанные в п. 7.2. настоящей Оферты, однозначно идентифицирующие его
                  как Покупателя, и достаточные для доставки Покупателю заказанного им Товара при условии доставки
                  товара.
                </li>
                <li>
                  <strong>6.3.3. </strong>Оплатить заказанный Товар и его доставку на условиях настоящего договора.
                </li>
                <li>
                  <strong>6.3.4. </strong>Во избежание споров, при оформлении заказа ознакомиться с информацией,
                  предложенной Продавцом на своем интернет-сайте.
                </li>
                <li>
                  <strong>6.3.5. </strong>Не использовать товар, заказанный на интернет-сайте в предпринимательских
                  целях.
                </li>
                <li>
                  <strong>6.3.6. </strong>Оплатить и принять заказанный Товар от Покупателя или третьего лица
                  (юридическим лицом оказывающий услуги по доставке Товара с которым Покупатель заключил договор на
                  оказание транспортно-экспедиторских услуг) поставленный на ранее оговоренный адрес (территорию)
                </li>
              </ol>
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            VII. ОФОРМЛЕНИЕ ЗАКАЗА
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>7.1. </strong>Заказ Товара осуществляется Покупателем через сервис сайта Интернет-магазина
              <a href="https://olcha.uz." class="font-font-550">https://olcha.uz.</a>
              <span class="underline">Покупатель обязательно должен уточнить о наличии товара и более подробную информацию о продукте у
                оператора сайта по телефону <a href="tel:712022021">(71) 202-202-1.</a></span>
            </li>
            <li>
              <strong>7.2. </strong>При регистрации на сайте Интернет-магазина Покупатель обязуется предоставить
              следующую регистрационную информацию:
              <ul class="grid grid-cols-1 gap-3 mt-3">
                <li>
                  <strong>7.2.1. </strong>Фамилия, имя, отчество, возраст Покупателя или указанного им лица
                  (получателя);
                </li>
                <li>
                  <strong>7.2.2. </strong>Фамилия, имя, отчество, возраст Покупателя или указанного им лица
                  (получателя);Адрес, по которому следует доставить Товар (если доставка до адреса Покупателя);
                </li>
                <li>
                  <strong>7.2.3. </strong>Адрес электронной почты;
                </li>
                <li>
                  <strong>7.2.4. </strong>Контактные телефоны.
                </li>
              </ul>
            </li>
            <li>
              <strong>7.3. </strong>Наименование, количество, ассортимент, артикул, цена выбранного Покупателем Товара
              указываются в корзине Покупателя на сайте Интернет-магазина.
            </li>
            <li>
              <strong>7.4. </strong>Если Продавцу необходима дополнительная информация, он вправе запросить ее у
              Покупателя. В случае не предоставления необходимой информации Покупателем, Продавец не несет
              ответственности за выбранный Покупателем Товар.
            </li>
            <li>
              <strong>7.5. </strong>Принятие Покупателем условий настоящей Оферты осуществляется посредством внесения
              Покупателем соответствующих данных в регистрационную форму на сайте Интернет-магазина или при оформлении
              Заказа через Оператора. После оформления Заказа через Оператора данные о Покупателе регистрируются в базе
              данных Продавца. Утвердив Заказ выбранного Товара, Покупатель предоставляет Оператору необходимую
              информацию в соответствии с порядком, указанном в п. 7.2. настоящей Оферты.
            </li>
            <li>
              <strong>7.6. </strong>Продавец не несет ответственности за содержание и достоверность информации,
              предоставленной Покупателем при оформлении Заказа.
            </li>
            <li>
              <strong>7.7. </strong>Покупатель несет ответственность за достоверность предоставленной информации при
              оформлении Заказа.
            </li>
            <li>
              <strong>7.8. </strong>Наименование, количество, ассортимент, артикул, цена выбранного Покупателем Товара
              указываются в корзине Покупателя на сайте Интернет-магазина.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            VIII. ДОСТАВКА И ПЕРЕДАЧА ТОВАРА
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>8.1. </strong>Продавец оказывает Покупателю услуги по доставке Товара одним, из способов,
              указанных на сайте Интернет-магазина в разделе <span class="underline">«Тип доставки»</span>.
            </li>
            <li>
              <strong>8.2. </strong>Если договор купли-продажи Товара дистанционным способом заключен с условием о
              доставке Товара Покупателю, Продавец обязан в установленный Договором срок доставить Товар в место,
              указанное Покупателем, а если место доставки Товара Покупателем не указано, то по месту его жительства или
              регистрации, о чем Продавец ставит в известность Покупателя.
            </li>
            <li>
              <strong>8.3. </strong>Место доставки Товара Покупатель указывает при оформлении Заказа на приобретение
              Товара в разделе <span class="underline">«Способ доставки»</span>.
            </li>
            <li>
              <strong>8.4. </strong>Срок доставки Товара Покупателю состоит из срока обработки заказа и срока доставки.
            </li>
            <li>
              <strong>8.5. </strong>Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо
              сообщает Покупателю при оформлении заказа Оператором.
            </li>
            <li>
              <strong>8.6. </strong>Продавец передает, а Покупатель принимает и оплачивает товары на условиях, указанных
              в настоящем договоре. Право собственности на Заказанные Товары переходит к Покупателю с момента
              фактической передачи Товара Покупателю и оплаты последним полной стоимости Товара. Риск случайной гибели
              или повреждения Товара переходит к Покупателю с момента фактической передачи Товара Покупателю.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            IХ. ВОЗВРАТ И ОБМЕН ТОВАРОВ
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <p class="font-font-550 mb-3">
                9.1. Товары надлежащего качества:
              </p>
              <ol class="grid grid-cols-1 gap-3">
                <li>
                  <strong>9.1.1. </strong>Покупатель вправе в течение десяти дней со дня покупки обменять
                  непродовольственный товар надлежащего качества на аналогичный у продавца, где он был приобретен, а в
                  случае отсутствия такого товара в продаже — получить денежную компенсацию.
                </li>
                <li>
                  <strong>9.1.2. </strong>Требования покупателя об обмене либо возврате товара подлежат удовлетворению в
                  следующих случаях:

                  <br><br>- если товар не был в употреблении;

                  <br><br>- сохранены его товарный вид, потребительские свойства, пломбы, ярлыки;

                  <br><br>- документ, подтверждающий факт и условия покупки указанного товара (товарный или кассовый
                  чек);
                </li>
                <li>
                  <strong>9.1.3. </strong> Возврату не подлежат (не принимаются обратно) товары надлежащего качества,
                  согласно Приложения 1 к Правилам розничной торговли Республики Узбекистан, утвержденное Постановлением
                  Кабинета Министров Республики Узбекистан № 75 от 13 февраля 2003 года:
                  <ol class="mt-3 ml-4">
                    <li>
                      1. Товары для профилактики и лечения заболеваний в домашних условиях (предметы санитарии и гигиены
                      из металла, резины, текстиля и других материалов, изделия медицинского назначения и медицинская
                      техника, средства гигиены полости рта, линзы очковые, предметы по уходу за детьми, лекарственные
                      препараты).
                    </li>
                    <li>
                      2. Предметы личной гигиены (зубные щетки, расчески, заколки, бигуди для волос, парики, шиньоны и
                      другие аналогичные товары).
                    </li>
                    <li>3. Парфюмерно-косметические товары.</li>
                    <li>
                      4. Текстильные товары (хлопчатобумажные, льняные, шелковые, шерстяные и синтетические ткани,
                      товары
                      из нетканых материалов типа тканей — ленты, тесьма, кружево и другие); кабельная продукция
                      (провода, шнуры, кабели); строительные и отделочные материалы (линолеум, пленка, ковровые покрытия
                      и другие) и другие товары, отпускаемые на метраж.
                    </li>
                    <li>
                      5. Швейные и трикотажные изделия (изделия швейные и трикотажные бельевые, чулочно-носочные и
                      перчаточные изделия).
                    </li>
                    <li>
                      6. Изделия и материалы, контактирующие с пищевыми продуктами, из полимерных материалов, в том
                      числе
                      для разового использования (посуда и принадлежности столовые и кухонные, емкости и упаковочные
                      материалы для хранения и транспортировки пищевых продуктов).
                    </li>
                    <li>7. Товары бытовой химии, пестициды и агрохимикаты.</li>
                    <li>8. Мебель (мебельные гарнитуры и комплекты).</li>
                    <li>
                      9. Изделия из драгоценных металлов, с драгоценными камнями, из драгоценных металлов со вставками
                      из
                      полудрагоценных и синтетических камней, ограненные драгоценные камни.
                    </li>
                    <li>
                      10. Автомобили и мотовелотовары, прицепы и номерные агрегаты к ним; мобильные средства малой
                      механизации сельскохозяйственных работ; прогулочные суда и иные плавсредства бытового назначения.
                    </li>
                    <li>
                      11. Технически сложные товары бытового назначения, на которые установлены гарантийные сроки
                      (станки
                      металлорежущие и деревообрабатывающие бытовые; электробытовые машины и бытовые электроприборы;
                      бытовая радиоэлектронная аппаратура; бытовая вычислительная и множительная техника; фото- и
                      киноаппаратура; телефонные аппараты и факсимильная аппаратура; электромузыкальные инструменты;
                      игрушки электронные).
                    </li>
                    <li>12. Животные и растения.</li>
                  </ol>
                </li>
                <li>
                  <strong>9.1.3. </strong>Возврат товара осуществляется посредством «Служба доставки» Продавца, для
                  этого необходимо:

                  <br><br>- позвонить в интернет-магазин по телефонам, указанным в разделе «Контакты»;

                  <br><br>- распечатать и заполнить «Заявление на возврат»;

                  <br><br>- приложить к заявлению на возврат товарный или кассовый чек заказа.
                </li>
              </ol>
            </li>
            <li>
              <p class="font-font-550 mb-3">
                9.2. Товары ненадлежащего качества:
              </p>
              <ol class="grid grid-cols-1 gap-3">
                <li>
                  <strong>9.2.1. </strong>Потребитель, которому продан товар с недостатками если недостатки обнаружены
                  в течение гарантийного срока либо срока годности товара или в течении шести месяцев по товарам на
                  которые не установлены сроки имеет требовать:

                  <br><br>- безвозмездного устранения недостатков товара или возмещения расходов на исправление
                  недостатков
                  потребителем либо третьим лицом;

                  <br><br>- соразмерного уменьшения покупной цены;

                  <br><br>Требования потребителя рассматриваются при предъявлении им кассового или товарного чека, а по
                  товарам,
                  на которые установлены гарантийные сроки, — надлежаще оформленного технического паспорта или иного
                  заменяющего его документа.
                </li>
                <li>
                  <strong>9.2.2. </strong>Процедура возврата товара ненадлежащего качества осуществляется следующим
                  образом:

                  <br><br>- Путем предоставления заявлении на возврат Товара в котором должно быть указано, какой именно
                  дефект
                  содержит возвращаемый Покупателем товар;

                  <br><br>- После принятия заявления, Товар направляется на проверку в техническую службу по оказанию
                  сервисных
                  услуг, который уполномочен производить техническую проверку определенного вида Товара для определение
                  возникновения причин недостатков Товара;

                  <br><br>- По итогам проверки уполномоченной технической службой по оказанию сервисных услуг
                  составляется
                  заключение о причинах недостатков Товара.

                  <br><br>- В случае если в период гарантийного срока недостатки Товара явились причиной заводского
                  брака
                  (дефекта), Товар подлежит замене, а в случае возможности технического устранения недостатков, Товар
                  подлежит безвозмездному устранения недостатков.
                </li>
                <li>
                  <strong>9.2.3. </strong>Порядок замены товара с недостатками:

                  <br><br>- В течении 7 дней (при явных признаках заводского брака)

                  <br><br>- В течении 20 дней (при необходимости дополнительной проверки)

                  <br><br>- В течении 1 месяца (при отсутствии товара аналогичной марки)

                  <br><br>- В течении 2 месяцев (при доставки в отдаленные территории).
                </li>
                <li>
                  <strong>9.2.4. </strong>Порядок устранения недостатков товара:

                  <br><br>- В течении 20 дней (после полной проверки технической службой по оказанию сервисных услуг).
                </li>
                <li>
                  <strong>9.2.5. </strong>После истечения гарантийного срока, претензии предъявляются производителю в
                  течении срока службы.
                </li>
              </ol>
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            Х. СПОСОБЫ ОПЛАТЫ
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>10.1. </strong>Произвести оплату Покупатель может следующими способами:

              <br><br>- оплата наличными средствами;

              <br><br>- оплата банковской пластиковой картой;

              <br><br>- оплата через платежные системы, указанных в интернет-адресе: https://olcha.uz

              <br><br>- безналичный расчет (для юридических лиц).
            </li>
            <li>
              <strong>10.2. </strong>Более подробная информация по способам оплаты товара содержится в разделе
              интернет-сайта «Способы оплаты».
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            XI. ФОРС-МАЖОР
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>11.1. </strong>Любая из Сторон освобождается от ответственности за полное или частичное
              неисполнение своих обязательств по настоящему Договору, если это неисполнение было вызвано
              обстоятельствами непреодолимой силы, возникшими после подписания настоящего Договора.
            </li>
            <li>
              <strong>11.2. </strong>«Обстоятельства Непреодолимой Силы» означают чрезвычайные события или
              обстоятельства, которые такая Сторона не могла предвидеть или предотвратить доступными ей средствами.
              Такие чрезвычайные события или обстоятельства включают в себя, в частности: забастовки, наводнения,
              пожары, землетрясения и иные стихийные бедствия, войны, военные действия, действия государственных органов
              Республики Узбекистан или иных государств, а также любые иные обстоятельства, выходящие за пределы
              разумного контроля любой из Сторон.
            </li>
            <li>
              <strong>11.3. </strong>Изменения действующего законодательства или нормативных актов, прямо или косвенно
              влияющие на какую-либо из Сторон, не рассматриваются как Обстоятельства непреодолимой силы, однако, в
              случае внесения таких изменений, которые не позволяют любой из Сторон исполнить какие-либо из ее
              обязательств по настоящему Договору, Стороны обязаны незамедлительно принять решение относительно порядка
              работы по устранению этой проблемы с тем, чтобы обеспечить Сторонам продолжение исполнения настоящего
              Договора.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            XII. ОТВЕТСТВЕННОСТЬ СТОРОН
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>12.1. </strong>За неисполнение или ненадлежащее исполнение условий настоящего Договора Стороны
              несут ответственность в соответствии с законодательством Республики Узбекистан.
            </li>
            <li>
              <strong>12.2. </strong>Вся текстовая информация, графические изображения и услуги, размещенные в
              интернет-магазине, имеют законного правообладателя, незаконное использование указанной информации и
              изображений преследуется в соответствии с действующим законодательством.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            XIII. ПРОЧИЕ УСЛОВИЯ
          </p>
          <ol class="grid grid-cols-1 gap-3">
            <li>
              <strong>13.1. </strong>Все споры, связанные с неисполнением, или ненадлежащим исполнением своих
              обязательств по настоящему договору стороны будут стараться решить в ходе переговоров.
            </li>
            <li>
              <strong>13.2. </strong>В случае не достижения согласия в ходе переговоров, споры будут разрешаться в
              судебном порядке в соответствии с действующим законодательством Республики Узбекистан.
            </li>
            <li>
              <strong>13.3. </strong>Разделы интернет-магазина, разъясняющие правила и условия, на которые имеются
              ссылки в Оферте являются неотъемлемой частью настоящей Оферты.
            </li>
            <li>
              <strong>13.4. </strong>Акцептируя настоящую оферту, Покупатель выражает согласие и разрешает ООО «OLCHA
              UZ» обрабатывать свои персональные данные, в том числе фамилию, имя, отчество, дату рождения, пол, место
              работы и должность, почтовый адрес, домашний, рабочий, мобильный телефоны, адрес электронной почты,
              включая сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение), использование,
              распространение, передачу на территории Республики Узбекистан, обезличивание, блокирование, уничтожение
              персональных данных, а также передачу их контрагентам Продавца с целью дальнейшей обработки (включая сбор,
              систематизацию, накопление, хранение, уточнение (обновление, изменение), использование, распространение на
              территории Республики Узбекистан, обезличивание, блокирование, уничтожение персональных данных) для
              проведения исследований, направленных на улучшение качества услуг, для проведения маркетинговых программ,
              статистических исследований, а также для продвижения услуг на рынке путем осуществления прямых контактов с
              Покупателем с помощью различных средств связи, включая, но, не ограничиваясь: почтовая рассылка,
              электронная почта, телефон, факсимильная связь, сеть Интернет.
            </li>
            <li>
              <strong>13.5. </strong>Покупатель выражает согласие и разрешает Продавцу и контрагентам Продавца
              обрабатывать персональные данные Покупателя, с помощью автоматизированных систем управления базами данных,
              а также иных программных средств, специально разработанных по поручению Продавца. Работа с такими
              системами осуществляется по предписанному оператором алгоритму (сбор, систематизация, накопление,
              хранение, уточнение, использование, блокирование, уничтожение). Используемые способы обработки (включая,
              но, не ограничиваясь): автоматическая сверка почтовых кодов с базой кодов, автоматическая проверка
              написания названий улиц\населенных пунктов, уточнение данных с Покупателем путем телефонной, почтовой
              связи с Покупателем или с помощью контакта через сеть Интернет, сегментация базы по заданным критериям.
              Покупатель соглашается с тем, что, если это необходимо для реализации целей, указанных в настоящей оферте,
              его персональные данные, полученные Продавцом, могут быть переданы третьим лицам, которым Продавец может
              поручить обработку персональных данных Покупателя на основании договора, заключенного с такими лицами, при
              условии соблюдения требований законодательства Республики Узбекистан об обеспечении такими третьими лицами
              конфиденциальности персональных данных и безопасности персональных данных при их обработке. При передаче
              указанных данных Покупателя Продавец предупреждает лиц, получающих персональные данные Покупателя, о том,
              что эти данные являются конфиденциальными и могут быть использованы лишь в целях, для которых они
              сообщены, и требуют от этих лиц соблюдения этого правила.
            </li>
            <li>
              <strong>13.6. </strong>Покупатель вправе запросить у Продавца полную информацию о своих персональных
              данных, их обработке и использовании, а также потребовать исключения или исправления/дополнения неверных
              или неполных персональных данных, отправив соответствующий письменный запрос на имя Продавца на почтовый
              адрес. Данное Покупателем согласие на обработку его персональных данных является бессрочным и может быть
              отозвано посредством направления Покупателем письменного заявления в адрес Продавца на почтовый адрес.
            </li>
          </ol>
        </li>
        <li class="mt-4">
          <p class="uppercase font-font-550 mb-3">
            XIV. РЕКВИЗИТЫ ПРОДАВЦА
          </p>
          <ul class="grid grid-cols-1 gap-3">
            <li class="font-font-550">
              <span class="tracking-widest">ПРОДАВЕЦ:</span>
              <br><span class="underline">Интернет-магазин ООО «OLCHA STORE»</span>
            </li>
            <li>
              г. Ташкент, Мирзо Улугбекский район, ул. Саларбуйи, дом 35А
            </li>
            <li>
              Р/С: 2020 8000 8051 7073 1001
            </li>
            <li>
              Шайхантахурский филиал АИКБ “Ипак Йули”
            </li>
            <li>
              МФО: 01145
            </li>
            <li>
              ИНН: 307086441
            </li>
            <li>
              ОКЭД: 47910
            </li>
          </ul>
        </li>
      </ol>
      <p class="mt-10 text-c-gray-6 text-base">
        Внимательно ознакомьтесь с текстом публичной оферты, если Вы не согласны с каким-либо пунктом
        оферты, Вы вправе отказаться от покупки Товаров, предоставляемых Продавцом, и не совершать действий указанной в
        п. 3.1. настоящей Оферты.
      </p>
    </div>
  </div>
</template>

<script>
import TitleContainer from '~/mobile/reusable/TitleContainer'

export default {
  components: {
    TitleContainer
  }
}
</script>
